mod-bee/modbee-node-uio/openPLC/projects/Modbee-Example/build/ESP32-S3/examples/Baremetal/c_blocks_code.cpp
#include <stdint.h>

#ifdef ARDUINO
#include <Arduino.h>
#endif

/*********************/
/*  IEC Types defs   */
/*********************/

typedef uint8_t  IEC_BOOL;

typedef int8_t    IEC_SINT;
typedef int16_t   IEC_INT;
typedef int32_t   IEC_DINT;
typedef int64_t   IEC_LINT;

typedef uint8_t    IEC_USINT;
typedef uint16_t   IEC_UINT;
typedef uint32_t   IEC_UDINT;
typedef uint64_t   IEC_ULINT;

typedef uint8_t    IEC_BYTE;
typedef uint16_t   IEC_WORD;
typedef uint32_t   IEC_DWORD;
typedef uint64_t   IEC_LWORD;

typedef float    IEC_REAL;
typedef double   IEC_LREAL;

#ifndef STR_MAX_LEN
#define STR_MAX_LEN 126
#endif

#ifndef STR_LEN_TYPE
#define STR_LEN_TYPE int8_t
#endif

typedef STR_LEN_TYPE __strlen_t;
typedef struct {
    __strlen_t len;
    uint8_t body[STR_MAX_LEN];
} IEC_STRING;

//definition of external blocks - MODBEE_ADD_REGISTER
typedef struct {
  IEC_BYTE *REG;
  IEC_WORD *ADDRESS;
  IEC_BOOL *VAR_BOOL;
  IEC_INT *VAR_INT;
  IEC_BOOL *DONE;
  IEC_BOOL *ERROR;
} MODBEE_ADD_REGISTER_VARS;

extern "C" void modbee_add_register_setup(MODBEE_ADD_REGISTER_VARS *vars);
extern "C" void modbee_add_register_loop(MODBEE_ADD_REGISTER_VARS *vars);

#define REG (*(vars->REG))
#define ADDRESS (*(vars->ADDRESS))
#define VAR_BOOL (*(vars->VAR_BOOL))
#define VAR_INT (*(vars->VAR_INT))
#define DONE (*(vars->DONE))
#define ERROR (*(vars->ERROR))

/* ================================================================
 *  C/C++ FUNCTION BLOCK
 *
 *  ---------------------------------------------------------------
 *  - This function block runs **in sync** with the PLC runtime.
 *  - The `setup()` function is called once when the block initializes.
 *  - The `loop()` function is called at every PLC scan cycle.
 *  - Block input and output variables declared in the variable table
 *    can be accessed directly by name in this C/C++ code.
 *
 *  This block executes as part of the main PLC process and follows
 *  the configured scan time in the Resources. Use it for real-time
 *  control logic, fast I/O operations, or any C-based algorithms.
 * ================================================================ */

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include <ESP32Modbee.h>
extern ESP32Modbee io;

// Called once when the block is initialized
void modbee_add_register_setup(MODBEE_ADD_REGISTER_VARS *vars)
{
  DONE = false;
  ERROR = false;
  
  // Validate register type
  if (REG > 3 || ADDRESS == 0) {
    ERROR = true;
    return;
  }
  
  // Register based on type - functions return void, just call them
  // These functions register the variable reference into the Modbus data map
  switch (REG) {
    case 0:  // COILS
      io.mbee.addCoil(ADDRESS, (bool*)&VAR_BOOL);
      break;
    case 1:  // INPUT STATUS
      io.mbee.addIsts(ADDRESS, (bool*)&VAR_BOOL);
      break;
    case 2:  // HOLDING REGISTERS
      io.mbee.addHreg(ADDRESS, (int16_t*)&VAR_INT);
      break;
    case 3:  // INPUT REGISTERS
      io.mbee.addIreg(ADDRESS, (int16_t*)&VAR_INT);
      break;
  }
  
  DONE = true;  // Functions return void; always succeeds for valid addresses
}

// Called at every PLC scan cycle
void modbee_add_register_loop(MODBEE_ADD_REGISTER_VARS *vars)
{
  // State maintained from setup() - nothing to do here
}
#undef REG
#undef ADDRESS
#undef VAR_BOOL
#undef VAR_INT
#undef DONE
#undef ERROR

//definition of external blocks - MODBEE_CONFIG
typedef struct {
} MODBEE_CONFIG_VARS;

extern "C" void modbee_config_setup(MODBEE_CONFIG_VARS *vars);
extern "C" void modbee_config_loop(MODBEE_CONFIG_VARS *vars);


/* ================================================================
 *  C/C++ FUNCTION BLOCK
 *
 *  ---------------------------------------------------------------
 *  - This function block runs **in sync** with the PLC runtime.
 *  - The `setup()` function is called once when the block initializes.
 *  - The `loop()` function is called at every PLC scan cycle.
 *  - Block input and output variables declared in the variable table
 *    can be accessed directly by name in this C/C++ code.
 *
 *  This block executes as part of the main PLC process and follows
 *  the configured scan time in the Resources. Use it for real-time
 *  control logic, fast I/O operations, or any C-based algorithms.
 * ================================================================ */

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include <ESP32Modbee.h>
extern ESP32Modbee io;

// Include ModBee debug macros
#include "ModBeeGlobal.h"

// Called once when the block is initialized
void modbee_config_setup(MODBEE_CONFIG_VARS *vars)
{

  // Configure timing parameters (optional but recommended higher values for wireless or slower networks)
  io.mbee.MODBEE_INTERFRAME_GAP_US        = 5000;  // 5000µs between frames (5ms) 
  io.mbee.MODBEE_OPERATION_TIMEOUT_MS     = 100;
  io.mbee.MODBEE_RESPONSE_TIMEOUT_MS      = 100;
  io.mbee.MODBEE_RETRY_DELAY_MS           = 100;
  io.mbee.MODBEE_MAX_RETRIES              = 2;
  io.mbee.INITIAL_LISTEN_PERIOD_MS        = 2000;  // Base initial listen time
  io.mbee.TOKEN_RESPONSE_TIMEOUT_MS       = 50;    // Token passing timeout
  io.mbee.BASE_TIMEOUT                    = 100;   
  io.mbee.NODE_TIMEOUT_MS                 = 50;
  io.mbee.MODBEE_TOKEN_RECLAIM_TIMEOUT    = 30;    // Token reclaim timeout (ms)
  io.mbee.MODBEE_JOIN_CYCLE_INTERVAL      = 50;    // Join invitation interval (ms)
  io.mbee.MODBEE_JOIN_RESPONSE_TIMEOUT    = 20;    // Join response wait time (ms)
  io.mbee.MODBEE_MAX_NODES                = 5;     // Maximum nodes allowed in network (set higher to allow future nodes)

  // Enable fail-safe mode (clears all registers and values on communication loss or node loss)
  io.mbee.enableFailSafe = true;
  
  delay(1000);
  // Connect to the network
  io.mbee.connect();
}

// Called at every PLC scan cycle
void modbee_config_loop(MODBEE_CONFIG_VARS *vars)
{

}

//definition of external blocks - MODBEE_HAT_PWR
typedef struct {
  IEC_BOOL *EN_HAT_POWER;
} MODBEE_HAT_PWR_VARS;

extern "C" void modbee_hat_pwr_setup(MODBEE_HAT_PWR_VARS *vars);
extern "C" void modbee_hat_pwr_loop(MODBEE_HAT_PWR_VARS *vars);

#define EN_HAT_POWER (*(vars->EN_HAT_POWER))

/* ================================================================
 *  C/C++ FUNCTION BLOCK
 *
 *  ---------------------------------------------------------------
 *  - This function block runs **in sync** with the PLC runtime.
 *  - The `setup()` function is called once when the block initializes.
 *  - The `loop()` function is called at every PLC scan cycle.
 *  - Block input and output variables declared in the variable table
 *    can be accessed directly by name in this C/C++ code.
 *
 *  This block executes as part of the main PLC process and follows
 *  the configured scan time in the Resources. Use it for real-time
 *  control logic, fast I/O operations, or any C-based algorithms.
 * ================================================================ */

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include <ESP32Modbee.h>
extern ESP32Modbee io;

// Called once when the block is initialized
void modbee_hat_pwr_setup(MODBEE_HAT_PWR_VARS *vars)
{

