mod-bee/modbee-node-uio/openPLC/projects/Modbee-Example/build/ESP32-S3/examples/Baremetal/c_blocks_code.cpp
    if (operation_id == 0)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_read_ctx(ctx);
      return;
    }

    ctx->operation_id = operation_id;
    ctx->queued = true;
    return;
  }
  
  // ===== STATE 3: OPERATION PENDING - WAIT FOR COMPLETION =====
  if (!REQ || DONE)
    return;

  if (ctx->queued)
  {
    if (ctx->completed)
    {
      DONE = true;
      ERROR = false;
      ctx->queued = false;
      ctx->started = false;
      ctx->operation_id = 0;

      const uint8_t len = ctx->len;
      switch (ctx->reg_type)
      {
      case 0:
        COIL_01 = (len > 0) ? ctx->coil_buffer[0] : false;
        COIL_02 = (len > 1) ? ctx->coil_buffer[1] : false;
        COIL_03 = (len > 2) ? ctx->coil_buffer[2] : false;
        COIL_04 = (len > 3) ? ctx->coil_buffer[3] : false;
        COIL_05 = (len > 4) ? ctx->coil_buffer[4] : false;
        COIL_06 = (len > 5) ? ctx->coil_buffer[5] : false;
        COIL_07 = (len > 6) ? ctx->coil_buffer[6] : false;
        COIL_08 = (len > 7) ? ctx->coil_buffer[7] : false;
        break;
      case 1:
        COIL_01 = (len > 0) ? ctx->ists_buffer[0] : false;
        COIL_02 = (len > 1) ? ctx->ists_buffer[1] : false;
        COIL_03 = (len > 2) ? ctx->ists_buffer[2] : false;
        COIL_04 = (len > 3) ? ctx->ists_buffer[3] : false;
        COIL_05 = (len > 4) ? ctx->ists_buffer[4] : false;
        COIL_06 = (len > 5) ? ctx->ists_buffer[5] : false;
        COIL_07 = (len > 6) ? ctx->ists_buffer[6] : false;
        COIL_08 = (len > 7) ? ctx->ists_buffer[7] : false;
        break;
      case 2:
        REG_01 = (len > 0) ? (int)ctx->hreg_buffer[0] : 0;
        REG_02 = (len > 1) ? (int)ctx->hreg_buffer[1] : 0;
        REG_03 = (len > 2) ? (int)ctx->hreg_buffer[2] : 0;
        REG_04 = (len > 3) ? (int)ctx->hreg_buffer[3] : 0;
        REG_05 = (len > 4) ? (int)ctx->hreg_buffer[4] : 0;
        REG_06 = (len > 5) ? (int)ctx->hreg_buffer[5] : 0;
        REG_07 = (len > 6) ? (int)ctx->hreg_buffer[6] : 0;
        REG_08 = (len > 7) ? (int)ctx->hreg_buffer[7] : 0;
        break;
      case 3:
        REG_01 = (len > 0) ? (int)ctx->ireg_buffer[0] : 0;
        REG_02 = (len > 1) ? (int)ctx->ireg_buffer[1] : 0;
        REG_03 = (len > 2) ? (int)ctx->ireg_buffer[2] : 0;
        REG_04 = (len > 3) ? (int)ctx->ireg_buffer[3] : 0;
        REG_05 = (len > 4) ? (int)ctx->ireg_buffer[4] : 0;
        REG_06 = (len > 5) ? (int)ctx->ireg_buffer[5] : 0;
        REG_07 = (len > 6) ? (int)ctx->ireg_buffer[6] : 0;
        REG_08 = (len > 7) ? (int)ctx->ireg_buffer[7] : 0;
        break;
      default:
        break;
      }
    }
    return;
  }
  
  // Not queued anymore and not done yet: nothing to do.
}
#undef REQ
#undef NODE_ID
#undef REG_TYPE
#undef START_ADDR
#undef LENGTH
#undef DONE
#undef ERROR
#undef NODE_ONLINE
#undef COIL_01
#undef COIL_02
#undef COIL_03
#undef COIL_04
#undef COIL_05
#undef COIL_06
#undef COIL_07
#undef COIL_08
#undef REG_01
#undef REG_02
#undef REG_03
#undef REG_04
#undef REG_05
#undef REG_06
#undef REG_07
#undef REG_08

//definition of external blocks - MODBEE_READ_ARRAY
typedef struct {
  IEC_BOOL *REQ;
  IEC_BYTE *NODE_ID;
  IEC_BYTE *REG_TYPE;
  IEC_WORD *START_ADDR;
  IEC_BYTE *LENGTH;
  IEC_BOOL *DONE;
  IEC_BOOL *ERROR;
  IEC_BOOL *NODE_ONLINE;
  IEC_BOOL *COILS;
  IEC_INT *REGS;
} MODBEE_READ_ARRAY_VARS;

extern "C" void modbee_read_array_setup(MODBEE_READ_ARRAY_VARS *vars);
extern "C" void modbee_read_array_loop(MODBEE_READ_ARRAY_VARS *vars);

#define REQ (*(vars->REQ))
#define NODE_ID (*(vars->NODE_ID))
#define REG_TYPE (*(vars->REG_TYPE))
#define START_ADDR (*(vars->START_ADDR))
#define LENGTH (*(vars->LENGTH))
#define DONE (*(vars->DONE))
#define ERROR (*(vars->ERROR))
#define NODE_ONLINE (*(vars->NODE_ONLINE))
#define COILS (vars->COILS)
#define REGS (vars->REGS)

/* ================================================================
 *  C/C++ FUNCTION BLOCK - MODBEE_READ_ARRAY (Multi-element, up to 32)
 *
 *  Reads multiple values from a ModBee node with array outputs.
 *  LENGTH specifies element count (1-32)
 *
 *  PROPER ASYNC STATE MACHINE WITH CALLBACKS:
 *  1. REQ rise: Start async read with callback
 *  2. Wait: Callback sets completion flag when response received
 *  3. Complete: Copy results when callback indicates success
 *  4. REQ fall: Reset all flags
 *
 *  INVARIANT: DONE=true ONLY means operation finished successfully
 * ================================================================ */

#include <stdint.h>
#include <stdbool.h>

#include <ESP32Modbee.h>
extern ESP32Modbee io;

#define MODBEE_READ_ARRAY_MAX_ELEMENTS 32
#define MODBEE_READ_ARRAY_MAX_INSTANCES 16

typedef struct
{
  void *key; // stable per-instance key (pointer into FB instance)
  bool in_use;

  bool last_req;
  bool started;
  bool queued;
  volatile bool completed;

  uint8_t reg_type;
  uint8_t len;
  uint8_t node_id;
  uint16_t start_addr;
  uint32_t operation_id;

  bool coil_buffer[MODBEE_READ_ARRAY_MAX_ELEMENTS];
  bool ists_buffer[MODBEE_READ_ARRAY_MAX_ELEMENTS];
  int16_t hreg_buffer[MODBEE_READ_ARRAY_MAX_ELEMENTS];
  int16_t ireg_buffer[MODBEE_READ_ARRAY_MAX_ELEMENTS];
} ModbeeReadArrayCtx;

static ModbeeReadArrayCtx s_modbee_read_array_ctx[MODBEE_READ_ARRAY_MAX_INSTANCES];

static ModbeeReadArrayCtx *get_modbee_read_array_ctx(MODBEE_READ_ARRAY_VARS *vars)
{
  (void)vars;
  // Use macro-safe stable address: &REQ expands to &(*(vars->REQ)) in generated code.
  void *key = (void *)&REQ;

  for (int i = 0; i < MODBEE_READ_ARRAY_MAX_INSTANCES; i++)
  {
    if (s_modbee_read_array_ctx[i].in_use && s_modbee_read_array_ctx[i].key == key)
      return &s_modbee_read_array_ctx[i];
  }
  for (int i = 0; i < MODBEE_READ_ARRAY_MAX_INSTANCES; i++)
  {
    if (!s_modbee_read_array_ctx[i].in_use)
    {
      s_modbee_read_array_ctx[i].in_use = true;
      s_modbee_read_array_ctx[i].key = key;
      s_modbee_read_array_ctx[i].last_req = false;
      s_modbee_read_array_ctx[i].started = false;
      s_modbee_read_array_ctx[i].queued = false;
      s_modbee_read_array_ctx[i].completed = false;
      s_modbee_read_array_ctx[i].reg_type = 0xFF;
      s_modbee_read_array_ctx[i].len = 0;
      s_modbee_read_array_ctx[i].node_id = 0;
      s_modbee_read_array_ctx[i].start_addr = 0;
      s_modbee_read_array_ctx[i].operation_id = 0;
      for (uint8_t j = 0; j < MODBEE_READ_ARRAY_MAX_ELEMENTS; j++)
      {
        s_modbee_read_array_ctx[i].coil_buffer[j] = false;
        s_modbee_read_array_ctx[i].ists_buffer[j] = false;
        s_modbee_read_array_ctx[i].hreg_buffer[j] = 0;
        s_modbee_read_array_ctx[i].ireg_buffer[j] = 0;
      }
      return &s_modbee_read_array_ctx[i];
    }
  }
  return nullptr;
}

static inline void reset_modbee_read_array_ctx(ModbeeReadArrayCtx *ctx)
{
  ctx->started = false;
  ctx->queued = false;
  ctx->completed = false;
  ctx->operation_id = 0;
  ctx->reg_type = 0xFF;
  ctx->len = 0;
}

// Callback for read completion. We map operationId back to the owning instance.
void modbeeReadArrayCallback(uint32_t operationId)
{
  for (int i = 0; i < MODBEE_READ_ARRAY_MAX_INSTANCES; i++)
  {
    if (s_modbee_read_array_ctx[i].in_use && s_modbee_read_array_ctx[i].queued && s_modbee_read_array_ctx[i].operation_id == operationId)
    {
      s_modbee_read_array_ctx[i].completed = true;
      return;
    }
  }
}

static inline uint8_t *modbee_read_array_coils_ptr(MODBEE_READ_ARRAY_VARS *vars)
{
  (void)vars;
  return (uint8_t *)COILS;
}

static inline int16_t *modbee_read_array_regs_ptr(MODBEE_READ_ARRAY_VARS *vars)
{
  (void)vars;
  return (int16_t *)REGS;
}

