mod-bee/modbee-node-uio/openPLC/projects/Modbee-Example/build/ESP32-S3/examples/Baremetal/c_blocks_code.cpp
static inline void modbee_read_array_clear_outputs(MODBEE_READ_ARRAY_VARS *vars)
{
  // Clear the full arrays to avoid stale data.
  uint8_t *coils = modbee_read_array_coils_ptr(vars);
  int16_t *regs = modbee_read_array_regs_ptr(vars);
  for (uint8_t i = 0; i < MODBEE_READ_ARRAY_MAX_ELEMENTS; i++)
  {
    coils[i] = 0;
    regs[i] = 0;
  }
}

void modbee_read_array_setup(MODBEE_READ_ARRAY_VARS *vars)
{
  DONE = false;
  ERROR = false;
  NODE_ONLINE = false;
  modbee_read_array_clear_outputs(vars);
}

void modbee_read_array_loop(MODBEE_READ_ARRAY_VARS *vars)
{
  ModbeeReadArrayCtx *ctx = get_modbee_read_array_ctx(vars);
  if (!ctx)
  {
    ERROR = true;
    DONE = false;
    return;
  }

  // ===== STATE 1: REQ falling edge - RESET =====
  if (!REQ && ctx->last_req)
  {
    ctx->last_req = false;
    DONE = false;
    ERROR = false;
    NODE_ONLINE = false;
    reset_modbee_read_array_ctx(ctx);
    return;
  }

  // ===== STATE 2: REQ rising edge - START OPERATION =====
  if (REQ && !ctx->last_req)
  {
    ctx->last_req = true;
    DONE = false;
    ERROR = false;
    modbee_read_array_clear_outputs(vars);

    NODE_ONLINE = io.mbee.isNodeKnown(NODE_ID);
    if (!NODE_ONLINE)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_read_array_ctx(ctx);
      return;
    }

    const uint8_t len = (uint8_t)LENGTH;
    if (len == 0 || len > MODBEE_READ_ARRAY_MAX_ELEMENTS)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_read_array_ctx(ctx);
      return;
    }

    const uint8_t reg_type = (uint8_t)REG_TYPE;
    if (reg_type > 3)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_read_array_ctx(ctx);
      return;
    }

    ctx->started = true;
    ctx->queued = false;
    ctx->completed = false;
    ctx->operation_id = 0;
    ctx->len = len;
    ctx->reg_type = reg_type;
    ctx->node_id = (uint8_t)NODE_ID;
    ctx->start_addr = (uint16_t)START_ADDR;

    uint32_t operation_id = 0;
    switch (ctx->reg_type)
    {
    case 0:
      operation_id = io.mbee.readCoilManual(ctx->node_id, ctx->start_addr, ctx->coil_buffer, ctx->len, 0, modbeeReadArrayCallback);
      break;
    case 1:
      operation_id = io.mbee.readIstsManual(ctx->node_id, ctx->start_addr, ctx->ists_buffer, ctx->len, 0, modbeeReadArrayCallback);
      break;
    case 2:
      operation_id = io.mbee.readHregManual(ctx->node_id, ctx->start_addr, ctx->hreg_buffer, ctx->len, 0, modbeeReadArrayCallback);
      break;
    case 3:
      operation_id = io.mbee.readIregManual(ctx->node_id, ctx->start_addr, ctx->ireg_buffer, ctx->len, 0, modbeeReadArrayCallback);
      break;
    default:
      break;
    }

    if (operation_id == 0)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_read_array_ctx(ctx);
      return;
    }

    ctx->operation_id = operation_id;
    ctx->queued = true;
    return;
  }

  // ===== STATE 3: OPERATION PENDING - WAIT FOR COMPLETION =====
  if (!REQ || DONE)
    return;

  if (ctx->queued)
  {
    if (ctx->completed)
    {
      DONE = true;
      ERROR = false;
      ctx->queued = false;
      ctx->started = false;
      ctx->operation_id = 0;

      const uint8_t len = ctx->len;
      uint8_t *coils = modbee_read_array_coils_ptr(vars);
      int16_t *regs = modbee_read_array_regs_ptr(vars);
      switch (ctx->reg_type)
      {
      case 0:
        for (uint8_t i = 0; i < len; i++)
          coils[i] = ctx->coil_buffer[i] ? 1 : 0;
        break;
      case 1:
        for (uint8_t i = 0; i < len; i++)
          coils[i] = ctx->ists_buffer[i] ? 1 : 0;
        break;
      case 2:
        for (uint8_t i = 0; i < len; i++)
          regs[i] = ctx->hreg_buffer[i];
        break;
      case 3:
        for (uint8_t i = 0; i < len; i++)
          regs[i] = ctx->ireg_buffer[i];
        break;
      default:
        break;
      }
    }
    return;
  }
}
#undef REQ
#undef NODE_ID
#undef REG_TYPE
#undef START_ADDR
#undef LENGTH
#undef DONE
#undef ERROR
#undef NODE_ONLINE
#undef COILS
#undef REGS

//definition of external blocks - MODBEE_WRITE
typedef struct {
  IEC_BOOL *REQ;
  IEC_BYTE *NODE_ID;
  IEC_BYTE *REG_TYPE;
  IEC_WORD *START_ADDR;
  IEC_BYTE *LENGTH;
  IEC_BOOL *COIL_01;
  IEC_BOOL *COIL_02;
  IEC_BOOL *COIL_03;
  IEC_BOOL *COIL_04;
  IEC_BOOL *COIL_05;
  IEC_BOOL *COIL_06;
  IEC_BOOL *COIL_07;
  IEC_BOOL *COIL_08;
  IEC_INT *REG_01;
  IEC_INT *REG_02;
  IEC_INT *REG_03;
  IEC_INT *REG_04;
  IEC_INT *REG_05;
  IEC_INT *REG_06;
  IEC_INT *REG_07;
  IEC_INT *REG_08;
  IEC_BOOL *DONE;
  IEC_BOOL *ERROR;
  IEC_BOOL *NODE_ONLINE;
} MODBEE_WRITE_VARS;

extern "C" void modbee_write_setup(MODBEE_WRITE_VARS *vars);
extern "C" void modbee_write_loop(MODBEE_WRITE_VARS *vars);

#define REQ (*(vars->REQ))
#define NODE_ID (*(vars->NODE_ID))
#define REG_TYPE (*(vars->REG_TYPE))
#define START_ADDR (*(vars->START_ADDR))
#define LENGTH (*(vars->LENGTH))
#define COIL_01 (*(vars->COIL_01))
#define COIL_02 (*(vars->COIL_02))
#define COIL_03 (*(vars->COIL_03))
#define COIL_04 (*(vars->COIL_04))
#define COIL_05 (*(vars->COIL_05))
#define COIL_06 (*(vars->COIL_06))
#define COIL_07 (*(vars->COIL_07))
#define COIL_08 (*(vars->COIL_08))
#define REG_01 (*(vars->REG_01))
#define REG_02 (*(vars->REG_02))
#define REG_03 (*(vars->REG_03))
#define REG_04 (*(vars->REG_04))
#define REG_05 (*(vars->REG_05))
#define REG_06 (*(vars->REG_06))
#define REG_07 (*(vars->REG_07))
#define REG_08 (*(vars->REG_08))
#define DONE (*(vars->DONE))
#define ERROR (*(vars->ERROR))
#define NODE_ONLINE (*(vars->NODE_ONLINE))

/* ================================================================
 *  C/C++ FUNCTION BLOCK
 *
 *  ---------------------------------------------------------------
 *  - This function block runs **in sync** with the PLC runtime.
 *  - The `setup()` function is called once when the block initializes.
 *  - The `loop()` function is called at every PLC scan cycle.
 *  - Block input and output variables declared in the variable table
 *    can be accessed directly by name in this C/C++ code.
 *
 *  This block executes as part of the main PLC process and follows
 *  the configured scan time in the Resources. Use it for real-time
 *  control logic, fast I/O operations, or any C-based algorithms.
 *
 *  PROPER ASYNC STATE MACHINE WITH CALLBACKS:
 *  1. REQ rise: Start async write with callback
 *  2. Wait: Callback sets completion flag when response received
 *  3. Complete: Set DONE when callback indicates success
 *  4. REQ fall: Reset all flags
 *  
 *  INVARIANT: DONE=true ONLY means operation finished successfully
 * ================================================================ */

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include <ESP32Modbee.h>
extern ESP32Modbee io;

#define MAX_ELEMENTS 8
#define MAX_INSTANCES 16

typedef struct
{
  void *key; // stable per-instance key (pointer into FB instance)
  bool in_use;

  bool last_req;
  bool started;
  bool queued;
  volatile bool completed;

  uint8_t reg_type;
  uint8_t len;
  uint8_t node_id;
  uint16_t start_addr;
  uint32_t operation_id;

  bool coil_buffer[MAX_ELEMENTS];
  int16_t hreg_buffer[MAX_ELEMENTS];
} ModbeeWriteCtx;

static ModbeeWriteCtx s_modbee_write_ctx[MAX_INSTANCES];

static ModbeeWriteCtx *get_modbee_write_ctx(MODBEE_WRITE_VARS *vars)
{
  (void)vars;
  // Use macro-safe stable address: &REQ expands to &(*(vars->REQ)) in generated code.
  void *key = (void *)&REQ;

  for (int i = 0; i < MAX_INSTANCES; i++)
  {
    if (s_modbee_write_ctx[i].in_use && s_modbee_write_ctx[i].key == key)
      return &s_modbee_write_ctx[i];
  }
  for (int i = 0; i < MAX_INSTANCES; i++)
  {
    if (!s_modbee_write_ctx[i].in_use)
    {
      s_modbee_write_ctx[i].in_use = true;
      s_modbee_write_ctx[i].key = key;
      s_modbee_write_ctx[i].last_req = false;
      s_modbee_write_ctx[i].started = false;
      s_modbee_write_ctx[i].queued = false;
      s_modbee_write_ctx[i].completed = false;
      s_modbee_write_ctx[i].reg_type = 0xFF;
      s_modbee_write_ctx[i].len = 0;
      s_modbee_write_ctx[i].node_id = 0;
      s_modbee_write_ctx[i].start_addr = 0;
      s_modbee_write_ctx[i].operation_id = 0;
      for (uint8_t j = 0; j < MAX_ELEMENTS; j++)
      {
        s_modbee_write_ctx[i].coil_buffer[j] = false;
        s_modbee_write_ctx[i].hreg_buffer[j] = 0;
      }
      return &s_modbee_write_ctx[i];
    }
  }
  return nullptr;
}

static inline void reset_modbee_write_ctx(ModbeeWriteCtx *ctx)
{
  ctx->started = false;
  ctx->queued = false;
  ctx->completed = false;
  ctx->operation_id = 0;
  ctx->reg_type = 0xFF;
  ctx->len = 0;
}

// Callback for write completion. We map operationId back to the owning instance.
void modbeeWriteCallback(uint32_t operationId)
{
  for (int i = 0; i < MAX_INSTANCES; i++)
  {
    if (s_modbee_write_ctx[i].in_use && s_modbee_write_ctx[i].queued && s_modbee_write_ctx[i].operation_id == operationId)
    {
      s_modbee_write_ctx[i].completed = true;
      return;
    }
  }
}

