mod-bee/modbee-node-uio/openPLC/projects/Modbee-Example/build/ESP32-S3/examples/Baremetal/c_blocks_code.cpp
void modbee_write_setup(MODBEE_WRITE_VARS *vars)
{
  DONE = false;
  ERROR = false;
  NODE_ONLINE = false;
}

void modbee_write_loop(MODBEE_WRITE_VARS *vars)
{
  ModbeeWriteCtx *ctx = get_modbee_write_ctx(vars);
  if (!ctx)
  {
    ERROR = true;
    DONE = false;
    return;
  }
  
  // ===== STATE 1: REQ falling edge - RESET =====
  if (!REQ && ctx->last_req)
  {
    ctx->last_req = false;
    DONE = false;
    ERROR = false;
    NODE_ONLINE = false;
    reset_modbee_write_ctx(ctx);
    return;
  }
  
  // ===== STATE 2: REQ rising edge - START OPERATION =====
  if (REQ && !ctx->last_req)
  {
    ctx->last_req = true;
    DONE = false;
    ERROR = false;
    
    NODE_ONLINE = io.mbee.isNodeKnown(NODE_ID);
    if (!NODE_ONLINE) {
      ERROR = true;
      DONE = false;  // Error occurred, operation not done
      return;
    }
    
    const uint8_t len = (uint8_t)LENGTH;
    if (len == 0 || len > MAX_ELEMENTS)
    {
      ERROR = true;
      DONE = false;  // Error occurred, operation not done
      reset_modbee_write_ctx(ctx);
      return;
    }

    const uint8_t reg_type = (uint8_t)REG_TYPE;
    if (reg_type != 0 && reg_type != 2)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_write_ctx(ctx);
      return;
    }

    ctx->started = true;
    ctx->queued = false;
    ctx->completed = false;
    ctx->operation_id = 0;
    ctx->len = len;
    ctx->reg_type = reg_type;
    ctx->node_id = (uint8_t)NODE_ID;
    ctx->start_addr = (uint16_t)START_ADDR;

    for (uint8_t i = 0; i < MAX_ELEMENTS; i++)
    {
      ctx->coil_buffer[i] = false;
      ctx->hreg_buffer[i] = 0;
    }

    if (ctx->reg_type == 0)
    {
      ctx->coil_buffer[0] = (len > 0) ? COIL_01 : false;
      ctx->coil_buffer[1] = (len > 1) ? COIL_02 : false;
      ctx->coil_buffer[2] = (len > 2) ? COIL_03 : false;
      ctx->coil_buffer[3] = (len > 3) ? COIL_04 : false;
      ctx->coil_buffer[4] = (len > 4) ? COIL_05 : false;
      ctx->coil_buffer[5] = (len > 5) ? COIL_06 : false;
      ctx->coil_buffer[6] = (len > 6) ? COIL_07 : false;
      ctx->coil_buffer[7] = (len > 7) ? COIL_08 : false;
    }
    else
    {
      ctx->hreg_buffer[0] = (len > 0) ? (int16_t)REG_01 : 0;
      ctx->hreg_buffer[1] = (len > 1) ? (int16_t)REG_02 : 0;
      ctx->hreg_buffer[2] = (len > 2) ? (int16_t)REG_03 : 0;
      ctx->hreg_buffer[3] = (len > 3) ? (int16_t)REG_04 : 0;
      ctx->hreg_buffer[4] = (len > 4) ? (int16_t)REG_05 : 0;
      ctx->hreg_buffer[5] = (len > 5) ? (int16_t)REG_06 : 0;
      ctx->hreg_buffer[6] = (len > 6) ? (int16_t)REG_07 : 0;
      ctx->hreg_buffer[7] = (len > 7) ? (int16_t)REG_08 : 0;
    }

    uint32_t operation_id = 0;
    if (ctx->reg_type == 0)
      operation_id = io.mbee.writeCoilManual(ctx->node_id, ctx->start_addr, ctx->coil_buffer, ctx->len, 0, modbeeWriteCallback);
    else
      operation_id = io.mbee.writeHregManual(ctx->node_id, ctx->start_addr, ctx->hreg_buffer, ctx->len, 0, modbeeWriteCallback);

    if (operation_id == 0)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_write_ctx(ctx);
      return;
    }

    ctx->operation_id = operation_id;
    ctx->queued = true;
    return;
  }
  
  // ===== STATE 3: OPERATION PENDING - WAIT FOR COMPLETION =====
  if (!REQ || DONE)
    return;

  if (ctx->queued)
  {
    if (ctx->completed)
    {
      DONE = true;
      ERROR = false;
      ctx->queued = false;
      ctx->started = false;
      ctx->operation_id = 0;
    }
    return;
  }
  
  // Not queued anymore and not done yet: nothing to do.
}
#undef REQ
#undef NODE_ID
#undef REG_TYPE
#undef START_ADDR
#undef LENGTH
#undef COIL_01
#undef COIL_02
#undef COIL_03
#undef COIL_04
#undef COIL_05
#undef COIL_06
#undef COIL_07
#undef COIL_08
#undef REG_01
#undef REG_02
#undef REG_03
#undef REG_04
#undef REG_05
#undef REG_06
#undef REG_07
#undef REG_08
#undef DONE
#undef ERROR
#undef NODE_ONLINE

//definition of external blocks - MODBEE_WRITE_ARRAY
typedef struct {
  IEC_BOOL *REQ;
  IEC_BYTE *NODE_ID;
  IEC_BYTE *REG_TYPE;
  IEC_WORD *START_ADDR;
  IEC_BYTE *LENGTH;
  IEC_BOOL *COILS;
  IEC_INT *REGS;
  IEC_BOOL *DONE;
  IEC_BOOL *ERROR;
  IEC_BOOL *NODE_ONLINE;
} MODBEE_WRITE_ARRAY_VARS;

extern "C" void modbee_write_array_setup(MODBEE_WRITE_ARRAY_VARS *vars);
extern "C" void modbee_write_array_loop(MODBEE_WRITE_ARRAY_VARS *vars);

#define REQ (*(vars->REQ))
#define NODE_ID (*(vars->NODE_ID))
#define REG_TYPE (*(vars->REG_TYPE))
#define START_ADDR (*(vars->START_ADDR))
#define LENGTH (*(vars->LENGTH))
#define COILS (vars->COILS)
#define REGS (vars->REGS)
#define DONE (*(vars->DONE))
#define ERROR (*(vars->ERROR))
#define NODE_ONLINE (*(vars->NODE_ONLINE))

/* ================================================================
 *  C/C++ FUNCTION BLOCK - MODBEE_WRITE_ARRAY (Multi-element, up to 32)
 *
 *  Writes multiple values to a ModBee node from array inputs.
 *  LENGTH specifies element count (1-32)
 *
 *  PROPER ASYNC STATE MACHINE WITH CALLBACKS:
 *  1. REQ rise: Start async write with callback
 *  2. Wait: Callback sets completion flag when response received
 *  3. Complete: Set DONE when callback indicates success
 *  4. REQ fall: Reset all flags
 *
 *  INVARIANT: DONE=true ONLY means operation finished successfully
 * ================================================================ */

#include <stdint.h>
#include <stdbool.h>

#include <ESP32Modbee.h>
extern ESP32Modbee io;

#define MODBEE_WRITE_ARRAY_MAX_ELEMENTS 32
#define MODBEE_WRITE_ARRAY_MAX_INSTANCES 16

typedef struct
{
  void *key; // stable per-instance key (pointer into FB instance)
  bool in_use;

  bool last_req;
  bool started;
  bool queued;
  volatile bool completed;

  uint8_t reg_type;
  uint8_t len;
  uint8_t node_id;
  uint16_t start_addr;
  uint32_t operation_id;

  bool coil_buffer[MODBEE_WRITE_ARRAY_MAX_ELEMENTS];
  int16_t hreg_buffer[MODBEE_WRITE_ARRAY_MAX_ELEMENTS];
} ModbeeWriteArrayCtx;

static ModbeeWriteArrayCtx s_modbee_write_array_ctx[MODBEE_WRITE_ARRAY_MAX_INSTANCES];

static ModbeeWriteArrayCtx *get_modbee_write_array_ctx(MODBEE_WRITE_ARRAY_VARS *vars)
{
  (void)vars;
  // Use macro-safe stable address: &REQ expands to &(*(vars->REQ)) in generated code.
  void *key = (void *)&REQ;

