mod-bee/modbee-node-uio/openPLC/projects/Modbee-Example/build/ESP32-S3/examples/Baremetal/c_blocks_code.cpp
  for (int i = 0; i < MODBEE_WRITE_ARRAY_MAX_INSTANCES; i++)
  {
    if (s_modbee_write_array_ctx[i].in_use && s_modbee_write_array_ctx[i].key == key)
      return &s_modbee_write_array_ctx[i];
  }
  for (int i = 0; i < MODBEE_WRITE_ARRAY_MAX_INSTANCES; i++)
  {
    if (!s_modbee_write_array_ctx[i].in_use)
    {
      s_modbee_write_array_ctx[i].in_use = true;
      s_modbee_write_array_ctx[i].key = key;
      s_modbee_write_array_ctx[i].last_req = false;
      s_modbee_write_array_ctx[i].started = false;
      s_modbee_write_array_ctx[i].queued = false;
      s_modbee_write_array_ctx[i].completed = false;
      s_modbee_write_array_ctx[i].reg_type = 0xFF;
      s_modbee_write_array_ctx[i].len = 0;
      s_modbee_write_array_ctx[i].node_id = 0;
      s_modbee_write_array_ctx[i].start_addr = 0;
      s_modbee_write_array_ctx[i].operation_id = 0;
      for (uint8_t j = 0; j < MODBEE_WRITE_ARRAY_MAX_ELEMENTS; j++)
      {
        s_modbee_write_array_ctx[i].coil_buffer[j] = false;
        s_modbee_write_array_ctx[i].hreg_buffer[j] = 0;
      }
      return &s_modbee_write_array_ctx[i];
    }
  }
  return nullptr;
}

static inline void reset_modbee_write_array_ctx(ModbeeWriteArrayCtx *ctx)
{
  ctx->started = false;
  ctx->queued = false;
  ctx->completed = false;
  ctx->operation_id = 0;
  ctx->reg_type = 0xFF;
  ctx->len = 0;
}

// Callback for write completion. We map operationId back to the owning instance.
void modbeeWriteArrayCallback(uint32_t operationId)
{
  for (int i = 0; i < MODBEE_WRITE_ARRAY_MAX_INSTANCES; i++)
  {
    if (s_modbee_write_array_ctx[i].in_use && s_modbee_write_array_ctx[i].queued && s_modbee_write_array_ctx[i].operation_id == operationId)
    {
      s_modbee_write_array_ctx[i].completed = true;
      return;
    }
  }
}

void modbee_write_array_setup(MODBEE_WRITE_ARRAY_VARS *vars)
{
  DONE = false;
  ERROR = false;
  NODE_ONLINE = false;
}

void modbee_write_array_loop(MODBEE_WRITE_ARRAY_VARS *vars)
{
  ModbeeWriteArrayCtx *ctx = get_modbee_write_array_ctx(vars);
  if (!ctx)
  {
    ERROR = true;
    DONE = false;
    return;
  }

  // ===== STATE 1: REQ falling edge - RESET =====
  if (!REQ && ctx->last_req)
  {
    ctx->last_req = false;
    DONE = false;
    ERROR = false;
    NODE_ONLINE = false;
    reset_modbee_write_array_ctx(ctx);
    return;
  }

  // ===== STATE 2: REQ rising edge - START OPERATION =====
  if (REQ && !ctx->last_req)
  {
    ctx->last_req = true;
    DONE = false;
    ERROR = false;

    NODE_ONLINE = io.mbee.isNodeKnown(NODE_ID);
    if (!NODE_ONLINE)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_write_array_ctx(ctx);
      return;
    }

    const uint8_t len = (uint8_t)LENGTH;
    if (len == 0 || len > MODBEE_WRITE_ARRAY_MAX_ELEMENTS)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_write_array_ctx(ctx);
      return;
    }

    const uint8_t reg_type = (uint8_t)REG_TYPE;
    if (reg_type != 0 && reg_type != 2)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_write_array_ctx(ctx);
      return;
    }

    ctx->started = true;
    ctx->queued = false;
    ctx->completed = false;
    ctx->operation_id = 0;
    ctx->len = len;
    ctx->reg_type = reg_type;
    ctx->node_id = (uint8_t)NODE_ID;
    ctx->start_addr = (uint16_t)START_ADDR;

    for (uint8_t i = 0; i < MODBEE_WRITE_ARRAY_MAX_ELEMENTS; i++)
    {
      ctx->coil_buffer[i] = false;
      ctx->hreg_buffer[i] = 0;
    }

    // Copy input arrays into persistent buffers for async write.
    // NOTE: In OpenPLC generated C, ARRAY pins are exposed as pointer macros.
    const uint8_t *coils_in = (const uint8_t *)COILS;
    const int16_t *regs_in = (const int16_t *)REGS;
    if (ctx->reg_type == 0)
    {
      for (uint8_t i = 0; i < len; i++)
        ctx->coil_buffer[i] = (coils_in[i] != 0);
    }
    else
    {
      for (uint8_t i = 0; i < len; i++)
        ctx->hreg_buffer[i] = regs_in[i];
    }

    uint32_t operation_id = 0;
    if (ctx->reg_type == 0)
      operation_id = io.mbee.writeCoilManual(ctx->node_id, ctx->start_addr, ctx->coil_buffer, ctx->len, 0, modbeeWriteArrayCallback);
    else
      operation_id = io.mbee.writeHregManual(ctx->node_id, ctx->start_addr, ctx->hreg_buffer, ctx->len, 0, modbeeWriteArrayCallback);

    if (operation_id == 0)
    {
      ERROR = true;
      DONE = false;
      reset_modbee_write_array_ctx(ctx);
      return;
    }

    ctx->operation_id = operation_id;
    ctx->queued = true;
    return;
  }

  // ===== STATE 3: OPERATION PENDING - WAIT FOR COMPLETION =====
  if (!REQ || DONE)
    return;

  if (ctx->queued)
  {
    if (ctx->completed)
    {
      DONE = true;
      ERROR = false;
      ctx->queued = false;
      ctx->started = false;
      ctx->operation_id = 0;
    }
    return;
  }
}
#undef REQ
#undef NODE_ID
#undef REG_TYPE
#undef START_ADDR
#undef LENGTH
#undef COILS
#undef REGS
#undef DONE
#undef ERROR
#undef NODE_ONLINE

//definition of external blocks - MODBUS_ADD_REGISTER
typedef struct {
  IEC_BYTE *REG;
  IEC_WORD *ADDRESS;
  IEC_BOOL *VAR_BOOL;
  IEC_INT *VAR_INT;
  IEC_BOOL *DONE;
  IEC_BOOL *ERROR;
} MODBUS_ADD_REGISTER_VARS;

extern "C" void modbus_add_register_setup(MODBUS_ADD_REGISTER_VARS *vars);
extern "C" void modbus_add_register_loop(MODBUS_ADD_REGISTER_VARS *vars);

#define REG (*(vars->REG))
#define ADDRESS (*(vars->ADDRESS))
#define VAR_BOOL (*(vars->VAR_BOOL))
#define VAR_INT (*(vars->VAR_INT))
#define DONE (*(vars->DONE))
#define ERROR (*(vars->ERROR))

/* ================================================================
 *  C/C++ FUNCTION BLOCK
 *
 *  ---------------------------------------------------------------
 *  - This function block runs **in sync** with the PLC runtime.
 *  - The `setup()` function is called once when the block initializes.
 *  - The `loop()` function is called at every PLC scan cycle.
 *  - Block input and output variables declared in the variable table
 *    can be accessed directly by name in this C/C++ code.
 *
 *  This block executes as part of the main PLC process and follows
 *  the configured scan time in the Resources. Use it for real-time
 *  control logic, fast I/O operations, or any C-based algorithms.
 * ================================================================ */

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include <ESP32Modbee.h>
extern ESP32Modbee io;

// Modbus ADD REGISTER - Self-contained register allocation and registration
// Each block instance allocates its own storage and registers automatically
// Registers once during setup() and maintains state

// Called once when the block is initialized
void modbus_add_register_setup(MODBUS_ADD_REGISTER_VARS *vars)
{
  DONE = false;
  ERROR = false;
  
  // Validate register type
  if (REG > 3 || ADDRESS == 0) {
    ERROR = true;
    return;
  }
  
  // Register based on type - same API as ESP32Modbee.cpp
  switch (REG) {
    case 0:  // COILS
      io.mb.addCoil(ADDRESS);
      io.mb.Coil(ADDRESS, 0);
      break;
    case 1:  // INPUT STATUS
      io.mb.addIsts(ADDRESS);
      io.mb.Ists(ADDRESS, 0);
      break;
    case 2:  // HOLDING REGISTERS
      io.mb.addHreg(ADDRESS, VAR_INT);
      io.mb.Hreg(ADDRESS, 0);
      break;
    case 3:  // INPUT REGISTERS
      io.mb.addIreg(ADDRESS);
      io.mb.Ireg(ADDRESS, 0);
      break;
  }
  
  DONE = true;  // Functions return void; always succeeds for valid addresses
}

// Called at every PLC scan cycle
void modbus_add_register_loop(MODBUS_ADD_REGISTER_VARS *vars)
{
  // State maintained from setup() - nothing to do here
}
#undef REG
#undef ADDRESS
#undef VAR_BOOL
#undef VAR_INT
#undef DONE
#undef ERROR

