mod-bee/modbee-node-uio/openPLC/projects/Modbee-Example/build/ESP32-S3/examples/Baremetal/c_blocks_code.cpp
  // REQ rising edge: latch parameters
  if (REQ && !ctx->last_req)
  {
    ctx->last_req = true;
    DONE = false;
    ERROR = false;
    modbus_read_array_clear_outputs(vars);

    const uint8_t len = (uint8_t)LENGTH;
    if (len == 0 || len > MODBUS_READ_ARRAY_MAX_ELEMENTS)
    {
      ERROR = true;
      DONE = true;
      reset_modbus_read_array_ctx(ctx);
      return;
    }

    ctx->started = true;
    ctx->queued = false;
    ctx->completed = false;
    ctx->success = false;
    ctx->len = len;
    ctx->reg_type = (uint8_t)REG_TYPE;
    ctx->slave_id = (uint8_t)SLAVE_ID;
    ctx->start_addr = (uint16_t)START_ADDR;
  }

  if (!REQ || DONE)
    return;

  if (ctx->queued)
  {
    if (ctx->completed)
    {
      DONE = true;
      ERROR = !ctx->success;
      ctx->queued = false;
      ctx->started = false;
      if (!ERROR)
        modbus_read_array_copy_results(vars, ctx);
    }
    return;
  }

  if (!ctx->started)
    return;

  if (!modbee_mb_claim(ctx))
    return;

  s_modbus_read_array_active = ctx;
  bool queued = false;
  switch (ctx->reg_type)
  {
  case 0:
    queued = (io.mb.readCoil(ctx->slave_id, ctx->start_addr, ctx->coil_buffer, ctx->len, modbusReadArrayCallback) != 0);
    break;
  case 1:
    queued = (io.mb.readIsts(ctx->slave_id, ctx->start_addr, ctx->ists_buffer, ctx->len, modbusReadArrayCallback) != 0);
    break;
  case 2:
    queued = (io.mb.readHreg(ctx->slave_id, ctx->start_addr, ctx->hreg_buffer, ctx->len, modbusReadArrayCallback) != 0);
    break;
  case 3:
    queued = (io.mb.readIreg(ctx->slave_id, ctx->start_addr, ctx->ireg_buffer, ctx->len, modbusReadArrayCallback) != 0);
    break;
  default:
    break;
  }

  if (!queued)
  {
    s_modbus_read_array_active = nullptr;
    modbee_mb_release(ctx);
    return;
  }

  ctx->queued = true;
}
#undef REQ
#undef SLAVE_ID
#undef REG_TYPE
#undef START_ADDR
#undef LENGTH
#undef DONE
#undef ERROR
#undef COILS
#undef REGS

//definition of external blocks - MODBUS_WRITE
typedef struct {
  IEC_BOOL *REQ;
  IEC_BYTE *SLAVE_ID;
  IEC_BYTE *REG_TYPE;
  IEC_WORD *START_ADDR;
  IEC_BYTE *LENGTH;
  IEC_BOOL *COIL_01;
  IEC_BOOL *COIL_02;
  IEC_BOOL *COIL_03;
  IEC_BOOL *COIL_04;
  IEC_BOOL *COIL_05;
  IEC_BOOL *COIL_06;
  IEC_BOOL *COIL_07;
  IEC_BOOL *COIL_08;
  IEC_INT *REG_01;
  IEC_INT *REG_02;
  IEC_INT *REG_03;
  IEC_INT *REG_04;
  IEC_INT *REG_05;
  IEC_INT *REG_06;
  IEC_INT *REG_07;
  IEC_INT *REG_08;
  IEC_BOOL *DONE;
  IEC_BOOL *ERROR;
} MODBUS_WRITE_VARS;

extern "C" void modbus_write_setup(MODBUS_WRITE_VARS *vars);
extern "C" void modbus_write_loop(MODBUS_WRITE_VARS *vars);

#define REQ (*(vars->REQ))
#define SLAVE_ID (*(vars->SLAVE_ID))
#define REG_TYPE (*(vars->REG_TYPE))
#define START_ADDR (*(vars->START_ADDR))
#define LENGTH (*(vars->LENGTH))
#define COIL_01 (*(vars->COIL_01))
#define COIL_02 (*(vars->COIL_02))
#define COIL_03 (*(vars->COIL_03))
#define COIL_04 (*(vars->COIL_04))
#define COIL_05 (*(vars->COIL_05))
#define COIL_06 (*(vars->COIL_06))
#define COIL_07 (*(vars->COIL_07))
#define COIL_08 (*(vars->COIL_08))
#define REG_01 (*(vars->REG_01))
#define REG_02 (*(vars->REG_02))
#define REG_03 (*(vars->REG_03))
#define REG_04 (*(vars->REG_04))
#define REG_05 (*(vars->REG_05))
#define REG_06 (*(vars->REG_06))
#define REG_07 (*(vars->REG_07))
#define REG_08 (*(vars->REG_08))
#define DONE (*(vars->DONE))
#define ERROR (*(vars->ERROR))

/* ================================================================
 *  C/C++ FUNCTION BLOCK - MODBUS_WRITE (Multi-element, up to 8)
 *
 *  Writes multiple values to Modbus slave from scalar inputs
 *  LENGTH specifies element count (1-8)
 *  
 *  PROPER STATE MACHINE:
 *  1. REQ rise: Queue write operation
 *  2. Wait: Monitor with 1000ms timeout
 *  3. Complete: Mark done (success/timeout)
 *  4. REQ fall: Reset all flags
 *  
 *  INVARIANT: DONE=true ONLY means operation finished (success or timeout)
 * ================================================================ */

#include <stdint.h>
#include <stdbool.h>

#include <ESP32Modbee.h>
extern ESP32Modbee io;

#define MAX_ELEMENTS 8
#define MAX_INSTANCES 16

// Shared Modbus transaction manager (see MODBUS_READ.cpp)
#ifndef MODBEE_OPENPLC_MODBUS_TX_MGR
#define MODBEE_OPENPLC_MODBUS_TX_MGR
static volatile void *modbee_mb_owner = nullptr;
static inline bool modbee_mb_claim(void *owner)
{
  if ((modbee_mb_owner != nullptr) && (modbee_mb_owner != owner))
    return false;
  modbee_mb_owner = owner;
  return true;
}
static inline void modbee_mb_release(void *owner)
{
  if (modbee_mb_owner == owner)
    modbee_mb_owner = nullptr;
}
#endif

typedef struct
{
  void *key; // stable per-instance key (e.g. pointer to REQ storage)
  bool in_use;

  bool last_req;
  bool started;
  bool queued;
  volatile bool completed;
  volatile bool success;

  uint8_t reg_type;
  uint8_t len;
  uint8_t slave_id;
  uint16_t start_addr;

  bool coil_buffer[MAX_ELEMENTS];
  uint16_t hreg_buffer[MAX_ELEMENTS];
} ModbusWriteCtx;

static ModbusWriteCtx s_modbus_write_ctx[MAX_INSTANCES];
static volatile ModbusWriteCtx *s_modbus_write_active = nullptr;

static ModbusWriteCtx *get_modbus_write_ctx(MODBUS_WRITE_VARS *vars)
{
  // IMPORTANT: `vars` is a stack-local struct in OpenPLC's generated code, so
  // `vars` (and its address) is NOT stable across scan cycles.
  // The pointers inside `vars` *are* stable (they point into the FB instance).
  // NOTE: In generated code, REQ is a macro like `#define REQ (*(vars->REQ))`.
  // So `vars->REQ` will get macro-expanded and break compilation.
  // `&REQ` expands to `&(*(vars->REQ))` which equals `vars->REQ` (stable per instance).
  void *key = (void *)&REQ;

  for (int i = 0; i < MAX_INSTANCES; i++)
  {
    if (s_modbus_write_ctx[i].in_use && s_modbus_write_ctx[i].key == key)
      return &s_modbus_write_ctx[i];
  }
  for (int i = 0; i < MAX_INSTANCES; i++)
  {
    if (!s_modbus_write_ctx[i].in_use)
    {
      s_modbus_write_ctx[i].in_use = true;
      s_modbus_write_ctx[i].key = key;
      s_modbus_write_ctx[i].last_req = false;
      s_modbus_write_ctx[i].started = false;
      s_modbus_write_ctx[i].queued = false;
      s_modbus_write_ctx[i].completed = false;
      s_modbus_write_ctx[i].success = false;
      s_modbus_write_ctx[i].reg_type = 0xFF;
      s_modbus_write_ctx[i].len = 0;
      s_modbus_write_ctx[i].slave_id = 0;
      s_modbus_write_ctx[i].start_addr = 0;
      return &s_modbus_write_ctx[i];
    }
  }
  return nullptr;
}

static void reset_modbus_write_ctx(ModbusWriteCtx *ctx)
{
  ctx->started = false;
  ctx->queued = false;
  ctx->completed = false;
  ctx->success = false;
  ctx->reg_type = 0xFF;
  ctx->len = 0;
}

bool modbusWriteCallback(Modbus::ResultCode event, uint16_t transactionId, void *data)
{
  (void)transactionId;
  (void)data;

  ModbusWriteCtx *ctx = (ModbusWriteCtx *)s_modbus_write_active;
  if (ctx)
  {
    ctx->completed = true;
    ctx->success = (event == Modbus::EX_SUCCESS);
    s_modbus_write_active = nullptr;
    modbee_mb_release(ctx);
  }
  return true;
}

void modbus_write_setup(MODBUS_WRITE_VARS *vars)
{
  DONE = false;
  ERROR = false;
}

void modbus_write_loop(MODBUS_WRITE_VARS *vars)
{
  ModbusWriteCtx *ctx = get_modbus_write_ctx(vars);
  if (!ctx)
  {
    ERROR = true;
    DONE = true;
    return;
  }

  // REQ falling edge: reset instance state
  if (!REQ && ctx->last_req)
  {
    ctx->last_req = false;
    reset_modbus_write_ctx(ctx);
    DONE = false;
    ERROR = false;
    if (s_modbus_write_active == ctx)
      s_modbus_write_active = nullptr;
    modbee_mb_release(ctx);
    return;
  }

  // REQ rising edge: latch parameters and build write buffers
  if (REQ && !ctx->last_req)
  {
    ctx->last_req = true;
    DONE = false;
    ERROR = false;

    const uint8_t len = (uint8_t)LENGTH;
    if (len == 0 || len > MAX_ELEMENTS)
    {
      ERROR = true;
      DONE = true;
      reset_modbus_write_ctx(ctx);
      return;
    }

    ctx->started = true;
    ctx->queued = false;
    ctx->completed = false;
    ctx->success = false;
    ctx->len = len;
    ctx->reg_type = (uint8_t)REG_TYPE;
    ctx->slave_id = (uint8_t)SLAVE_ID;
    ctx->start_addr = (uint16_t)START_ADDR;

    // Build persistent buffers for the async write
    for (uint8_t i = 0; i < MAX_ELEMENTS; i++)
    {
      ctx->coil_buffer[i] = false;
      ctx->hreg_buffer[i] = 0;
    }

    if (ctx->reg_type == 0)
    {
      ctx->coil_buffer[0] = (len > 0) ? COIL_01 : false;
      ctx->coil_buffer[1] = (len > 1) ? COIL_02 : false;
      ctx->coil_buffer[2] = (len > 2) ? COIL_03 : false;
      ctx->coil_buffer[3] = (len > 3) ? COIL_04 : false;
      ctx->coil_buffer[4] = (len > 4) ? COIL_05 : false;
      ctx->coil_buffer[5] = (len > 5) ? COIL_06 : false;
      ctx->coil_buffer[6] = (len > 6) ? COIL_07 : false;
      ctx->coil_buffer[7] = (len > 7) ? COIL_08 : false;
    }
    else if (ctx->reg_type == 2)
    {
      ctx->hreg_buffer[0] = (len > 0) ? (uint16_t)REG_01 : 0;
      ctx->hreg_buffer[1] = (len > 1) ? (uint16_t)REG_02 : 0;
      ctx->hreg_buffer[2] = (len > 2) ? (uint16_t)REG_03 : 0;
      ctx->hreg_buffer[3] = (len > 3) ? (uint16_t)REG_04 : 0;
      ctx->hreg_buffer[4] = (len > 4) ? (uint16_t)REG_05 : 0;
      ctx->hreg_buffer[5] = (len > 5) ? (uint16_t)REG_06 : 0;
      ctx->hreg_buffer[6] = (len > 6) ? (uint16_t)REG_07 : 0;
      ctx->hreg_buffer[7] = (len > 7) ? (uint16_t)REG_08 : 0;
    }
    else
    {
      ERROR = true;
      DONE = true;
      reset_modbus_write_ctx(ctx);
      return;
    }
  }

